package hello.jdbc.writedown;

public class writedown {

    /**
     * 트랜잭션 - 개념 이해
     * */

    /**
     * 데이터베이스 연결 구조와 DB 세션
     * */

    /**
     * 트랜잭션 - DB 예제 1 - 개념 이해
     * */

     /**
     * 트랜잭션 - DB 예제 2 - 자동 커밋, 수동 커밋
     * */

    /**
     * 트랜잭션 - DB 예제 3 - 트랜잭션 실습
     * */

    /**
     * DB 락 - 개념 이해
     * */

    /**
     * DB 락 - 변경
     * */

    /**
     * DB 락 - 조회
     * */

    /**
     * 문제점들
     * */

    /**
     * 트랜잭션 추상화
     * */

    /**
     * 트랜잭션 동기화
     * */

    /**
     * 트랜잭션 문제해결 - 트랜잭션 매니저1
     * */

    /**
     * 트랜잭션 문제해결 - 트랜잭션 매니저2
     * */

    /**
     * 트랜잭션 문제해결 - 트랜잭션 템플릿
     * */

    /**
     * 트랜잭션 문제해결 - 트랜잭션 AOP 이해
     * */

    /**
     * 트랜잭션 문제해결 - 트랜잭션 AOP 적용
     * */

    /**
     * 트랜잭션 문제해결 - 트랜잭션 AOP 정리
     * */

    /**
     * 스프링 부트의 자동 리소스 등록
     * */

    /**
     * 정리
     * */

    //------------------------------------------------

    /**
     * 예외 계층
     * */

    /**
     * 예외 기본 규칙
     * */
}
