package hello.jdbc.writedown;

public class writedown {

    /**
     * 트랜잭션 - 개념 이해
     * */

    /**
     * 데이터베이스 연결 구조와 DB 세션
     * */

    /**
     * 트랜잭션 - DB 예제 1 - 개념 이해
     * */

     /**
     * 트랜잭션 - DB 예제 2 - 자동 커밋, 수동 커밋
     * */

    /**
     * 트랜잭션 - DB 예제 3 - 트랜잭션 실습
     * */

    /**
     * DB 락 - 개념 이해
     * */

    /**
     * DB 락 - 변경
     * */

    /**
     * DB 락 - 조회
     * */

    /**
     * 문제점들
     * */

    /**
     * 트랜잭션 추상화
     * */

    /**
     * 트랜잭션 동기화
     * */
}
